; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v2 ?v10)
             (pred_3 ?v11 ?v1)
             (pred_11 ?v2 ?v1)
             (pred_7 ?v4 ?v2 )
	     (pred_5 ?v2)
             (pred_2 ?v9)
             (pred_12 ?v11)
             (pred_10 ?v1)
             (pred_8 ?v2)
             (pred_1 ?v11)
             (pred_4 ?v2)
             (pred_9 ))



(:action op_1
:parameters (?v13 ?v7 ?v3 ?v5)
:precondition (and (pred_2 ?v13) (pred_2 ?v7) (pred_12 ?v3) (pred_10 ?v5)
          (pred_6 ?v13 ?v7) (pred_3 ?v3 ?v5)
                   (pred_11 ?v7 ?v5) (pred_5 ?v13) 
                   (pred_8 ?v7) (pred_1 ?v3))
:effect (and  (pred_4 ?v7) (not (pred_8 ?v7))))


(:action op_4
:parameters (?v13 ?v6)
:precondition (and (pred_2 ?v13) (pred_2 ?v6)
               (pred_5 ?v13) (pred_6 ?v13 ?v6) (pred_4 ?v6))
:effect (and (pred_5 ?v6) (not (pred_5 ?v13))))

(:action op_5
:parameters (?v13 ?v3)
:precondition (and (pred_2 ?v13) (pred_12 ?v3) 
                  (pred_5 ?v13) (pred_7 ?v3 ?v13) (pred_9 ))
:effect (and (pred_1 ?v3)
   (not (pred_7 ?v3 ?v13)) (not (pred_9 ))))


(:action op_3
:parameters (?v13 ?v8 ?v12)
:precondition (and (pred_2 ?v13) (pred_12 ?v8) (pred_12 ?v12)
                  (pred_5 ?v13) (pred_1 ?v12) (pred_7 ?v8 ?v13))
:effect (and (pred_1 ?v8) (pred_7 ?v12 ?v13)
        (not (pred_1 ?v12)) (not (pred_7 ?v8 ?v13))))

(:action op_2
:parameters (?v13 ?v3)
:precondition (and (pred_2 ?v13) (pred_12 ?v3) 
                  (pred_5 ?v13) (pred_1 ?v3))
:effect (and (pred_9 ) (pred_7 ?v3 ?v13) (not (pred_1 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_15 obj_16 obj_19 obj_01 obj_02 obj_06 obj_05 obj_14 obj_04 obj_07 obj_20 obj_08 obj_12 obj_10 obj_13
    obj_03 obj_09
    obj_17 obj_18
    )

    (:init
       (pred_9)

       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_2 obj_16)
       (pred_2 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_02)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_14)
       (pred_2 obj_04)
       (pred_2 obj_07)
       (pred_2 obj_20)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_10)
       (pred_2 obj_13)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_12 obj_17)
       (pred_12 obj_18)

       (pred_6 obj_11 obj_01)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_15 obj_16)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_15)
       (pred_6 obj_19 obj_05)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_02 obj_01)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_05 obj_19)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_04)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_04 obj_14)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_20 obj_13)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_12 obj_10)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_12)
       (pred_6 obj_13 obj_20)
       (pred_6 obj_13 obj_10)
       (pred_8 obj_13)
       (pred_8 obj_20)
       (pred_11  obj_13 obj_03)
       (pred_11  obj_20 obj_09)
       (pred_4 obj_11)
       (pred_4 obj_15)
       (pred_4 obj_16)
       (pred_4 obj_19)
       (pred_4 obj_01)
       (pred_4 obj_02)
       (pred_4 obj_06)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_4 obj_04)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_4 obj_12)
       (pred_4 obj_10)

       (pred_3  obj_17 obj_03)
       (pred_3  obj_18 obj_09)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_18 obj_19)
       (pred_5 obj_05)
    )

    (:goal (and
       (pred_7 obj_17 obj_04)
    ))
(:constraints
  (always (not (pred_5 obj_02)))
)
)

; plan
1. (op_4 obj_05 obj_06)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_07)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_07)
   goals met: 0 of 1
3. (op_4 obj_07 obj_04)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_04)
   goals met: 0 of 1
4. (op_4 obj_04 obj_14)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_14)
   goals met: 0 of 1
5. (op_4 obj_14 obj_01)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_01)
   goals met: 0 of 1
6. (op_5 obj_01 obj_17)
   deleted: (pred_7 obj_17 obj_01) (pred_9)
   added: (pred_1 obj_17)
   goals met: 0 of 1
7. (op_4 obj_01 obj_14)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_14)
   goals met: 0 of 1
8. (op_4 obj_14 obj_04)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_04)
   goals met: 0 of 1
9. (op_2 obj_04 obj_17)
   deleted: (pred_1 obj_17)
   added: (pred_9) (pred_7 obj_17 obj_04)
   goals met: 1 of 1
